<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>

<%@ page 
	import="superlines.core.Configuration"
%>


<ul>
				<li><div  style="background:#dddddd"><b>описание</b></div>
					<div style="padding: 10px;">
					Superlines - разновидность популярной DOS-игры  <a href='https://ru.wikipedia.org/wiki/Lines'>Шарики</a>, полностью реализованная на Java		
					</div>
				</li>
					
				<li><div  style="background:#dddddd"><b>правила</b></div>
					<div style="padding: 10px;">
					основным нововведением является система "рангов". Ранг 
					является показателем опытности игрока и влияет на 
					сложность игры. Чем выше ранг, тем сложнее играть.
					Изначально игроку присваивается ранг НОВИЧОК. Ранг
					игрока повышается, когда он выполняет норматив этого ранга.
					Количество очков, необходимое для получения
					следующего ранга, указано в таблице нормативов.
					Очки подсчитываются по результатам игр, сыгранных
					при текущем рейтинге игрока. Следует иметь ввиду, что
					зачитывается результат не всех игр, а только тех, в которых
					игрок набрал не менее определенного порогового количества очков, 
					характерного для его ранга. 
					Для некоторых рангов действует система прогрессивного начисления очков. 
					Когда количество очков в игре переваливает за некоторое пороговое значение,
					дальнейшие выигрыши домножаются на предопределенный коэффициент.  Эти и другие
					значения можно подсмотреть в таблице правил.
					
					</div>
					
					<a class='lnk' href="?page=faq">FAQ</a>
					<a  class='lnk' href="?page=rules">правила</a>		
					<a  class='lnk' href="?page=rate">рейтинги</a>
					<a  class='lnk' href="?page=registration">создать аккаунт</a>
					<a  class='lnk' href="?page=remind">напомнить пароль</a>				
					<a  class='lnk' href='downloads/superlines2.zip'>загрузка </a>	
	
					
					</li>
				
				
			</ul>