<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>

<%@ page 
	import="superlines.core.Configuration"
%>


<ul>
				<li><div  style="background:#dddddd"><b>описание</b></div>
					<div style="padding: 10px;">
					JLines - разновидность популярной DOS-игры  <a href='https://ru.wikipedia.org/wiki/Lines'>Шарики</a>, полностью реализованная на Java		
					</div>
				</li>
					
				<li><div  style="background:#dddddd"><b>правила</b></div>
					<div style="padding: 10px;">
					отличительная черта Superlines - система "рангов" в игре. Ранг 
					является показателем опытности игрока и влияет на 
					сложность игры. Чем выше ранг, тем сложнее играть.
					Изначально игроку присваивается ранг НОВИЧОК. Ранг
					игрока повышается, когда он выполняет норматив следующего ранга.
					Количество очков, необходимое для повышения ранга, указано в таблице нормативов.
					Очки начисляются за составление линий в игре. Следует иметь ввиду, что
					засчитываются очки только тех игр, в которых
					игрок набрал не менее определенного порогового количества очков.
					Для некоторых рангов действует система прогрессивного начисления очков, когда очки за линии домножаются на некоторый коэффициент (множитель прогрессив). Это происходит, когда
					количество очков за игру превысило некоторое пороговое значение (порог прогрессив). Значения
					порогов и множителей прогрессив указаны в таблице правил
		
					
					</div>
					
					<a class='lnk' href="?page=faq">FAQ</a>
					<a  class='lnk' href="?page=rules">правила</a>		
					<a  class='lnk' href="?page=rate">рейтинги</a>
					<a  class='lnk' href="?page=registration">создать аккаунт</a>
					<a  class='lnk' href="?page=remind">напомнить пароль</a>				
					<a  class='lnk' href='downloads/superlines2.zip'>загрузка </a>	
	
					
					</li>
				
				
			</ul>